In [2]:
import pandas as pd #import pandas

In [3]:
data = pd.read_csv('titanic/train.csv') #comma separed values, valores separados por vírgula

In [5]:
data.columns = ['PassageiroID', 'Sobreviventes', 'Classe', 'Nome', 'Sexo', 'Idade', 'IrmaosParesAmorosos',
       'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [6]:
data.head()

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data['Idade'].mean() #média

29.69911764705882

In [8]:
data['Idade'].sum() #somatório

21205.17

In [10]:
data['Idade'].count() #quantidade de idades

714

In [12]:
data['Idade'].median() #mediana

28.0

In [14]:
data['Idade'].mode() #moda

0    24.0
dtype: float64

In [15]:
data['Idade'].max() #valor máximo

80.0

In [16]:
data['Idade'].min() #valor mínimo

0.42

In [18]:
data['Idade'].idxmin() #index do valor minimo

803

In [20]:
data['Idade'].idxmax() #index do valor maximo

630

In [21]:
data.mean()

PassageiroID           446.000000
Sobreviventes            0.383838
Classe                   2.308642
Idade                   29.699118
IrmaosParesAmorosos      0.523008
PaisFilhos               0.381594
Tarifa                  32.204208
dtype: float64

In [22]:
data.sum()

PassageiroID                                                      397386
Sobreviventes                                                        342
Classe                                                              2057
Nome                   Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo                   malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                            21205.2
IrmaosParesAmorosos                                                  466
PaisFilhos                                                           340
Bilhete                A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                           28693.9
dtype: object

In [23]:
data.min()

PassageiroID                             1
Sobreviventes                            0
Classe                                   1
Nome                   Abbing, Mr. Anthony
Sexo                                female
Idade                                 0.42
IrmaosParesAmorosos                      0
PaisFilhos                               0
Bilhete                             110152
Tarifa                                   0
dtype: object

In [25]:
data

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
data.iloc[630] #ver o que está em uma posição (index)

PassageiroID                                            631
Sobreviventes                                             1
Classe                                                    1
Nome                   Barkworth, Mr. Algernon Henry Wilson
Sexo                                                   male
Idade                                                    80
IrmaosParesAmorosos                                       0
PaisFilhos                                                0
Bilhete                                               27042
Tarifa                                                   30
Cabine                                                  A23
Embarque                                                  S
Name: 630, dtype: object

In [34]:
data.iloc[803] #ver o que está em uma posição (index) - data series

PassageiroID                                       804
Sobreviventes                                        1
Classe                                               3
Nome                   Thomas, Master. Assad Alexander
Sexo                                              male
Idade                                             0.42
IrmaosParesAmorosos                                  0
PaisFilhos                                           1
Bilhete                                           2625
Tarifa                                          8.5167
Cabine                                             NaN
Embarque                                             C
Name: 803, dtype: object

In [36]:
data.iloc[[630]] #ver o que está em uma posição (index)

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [39]:
data.iloc[[330,220,110]]

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
330,331,1,3,"McCoy, Miss. Agnes",female,NaN,2,0,367226,23.25,NaN,Q
220,221,1,3,"Sunderland, Mr. Victor Francis",male,16.0,0,0,SOTON/OQ 392089,8.05,NaN,S
110,111,0,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.00,C110,S

In [41]:
data.iloc[880:]

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [43]:
data['Classe'].iloc[2] #classe do passageiro de index 2

3

In [44]:
data['Nome'].iloc[2] #nome do passageiro index 2

'Heikkinen, Miss. Laina'